# Pandas Tutorial
<span style=color:#0ff1f5>This note book explains all about pandas library, these are my notes and practice from python ka chilla course.</span>

### -How to Install Libraries

- since I already have installed it thats why made it a comment, you need to remove "#" sign from the start

In [2]:
#pip install pandas

### -Import libraries

In [3]:
import pandas as pd
import numpy as np

In [4]:
# Object Creation

s=pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# you can also add an empty cell using numpy

s=pd.Series([1,2,3,np.nan,4,5])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [6]:
s = pd.Series([3,5,7,np.nan,1,8])
s

0    3.0
1    5.0
2    7.0
3    NaN
4    1.0
5    8.0
dtype: float64

In [7]:
dates= pd.date_range("20220101", periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
dates= pd.date_range("20220101", periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

#### - Data series to Data frame

In [9]:
# now converting date series to data frame(df is worksheet means rows and cols)

df= pd.DataFrame(np.random.rand(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2022-01-01  0.540202  0.782659  0.006355  0.917433
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-05  0.143740  0.084089  0.899807  0.960813
2022-01-06  0.999235  0.442767  0.916618  0.916194

In [10]:
df2= pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220307"),
        "C": pd.Series(1,index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test" , "train" ,"test" ,"train"]),
        "F": "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2022-03-07  1.0  3   test  foo
1  1.0 2022-03-07  1.0  3  train  foo
2  1.0 2022-03-07  1.0  3   test  foo
3  1.0 2022-03-07  1.0  3  train  foo

#### -Data frame types

In [11]:
# Data frame types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df

                   A         B         C         D
2022-01-01  0.540202  0.782659  0.006355  0.917433
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-05  0.143740  0.084089  0.899807  0.960813
2022-01-06  0.999235  0.442767  0.916618  0.916194

In [13]:
# to see first 5 rows of dataframe
df.head()

                   A         B         C         D
2022-01-01  0.540202  0.782659  0.006355  0.917433
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-05  0.143740  0.084089  0.899807  0.960813

In [14]:
# to see last 5 rows of DF
df.tail()

                   A         B         C         D
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-05  0.143740  0.084089  0.899807  0.960813
2022-01-06  0.999235  0.442767  0.916618  0.916194

In [15]:
# to see the Index Column
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

#### -Dataframe to numpy

In [17]:
# converting datafframe to numpy meaning into array

df.to_numpy()

array([[0.54020188, 0.78265896, 0.00635533, 0.91743312],
       [0.41560812, 0.95838055, 0.04971301, 0.01967534],
       [0.81587021, 0.55635163, 0.7116996 , 0.06839529],
       [0.85057176, 0.47643398, 0.33830793, 0.79156361],
       [0.14374025, 0.08408869, 0.89980691, 0.96081346],
       [0.99923459, 0.44276733, 0.91661805, 0.91619368]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.627538  0.550114  0.487083  0.612346
std    0.319366  0.301639  0.412267  0.444093
min    0.143740  0.084089  0.006355  0.019675
25%    0.446757  0.451184  0.121862  0.249187
50%    0.678036  0.516393  0.525004  0.853879
75%    0.841896  0.726082  0.852780  0.917123
max    0.999235  0.958381  0.916618  0.960813

#### -Transpose

In [19]:
# transpose dataframe meaning to convert rows to cols and cols to rows

df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-03-07 00:00:00,2022-03-07 00:00:00,2022-03-07 00:00:00,2022-03-07 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

#### - sorting Index column

In [20]:
df.sort_index(axis=0 ,ascending=False)

                   A         B         C         D
2022-01-06  0.999235  0.442767  0.916618  0.916194
2022-01-05  0.143740  0.084089  0.899807  0.960813
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-01  0.540202  0.782659  0.006355  0.917433

In [21]:
# sort data frame on colm base

df.sort_values(by="B")

                   A         B         C         D
2022-01-05  0.143740  0.084089  0.899807  0.960813
2022-01-06  0.999235  0.442767  0.916618  0.916194
2022-01-04  0.850572  0.476434  0.338308  0.791564
2022-01-03  0.815870  0.556352  0.711700  0.068395
2022-01-01  0.540202  0.782659  0.006355  0.917433
2022-01-02  0.415608  0.958381  0.049713  0.019675

In [22]:
# Selecting a specific coloum

df["A"]

2022-01-01    0.540202
2022-01-02    0.415608
2022-01-03    0.815870
2022-01-04    0.850572
2022-01-05    0.143740
2022-01-06    0.999235
Freq: D, Name: A, dtype: float64

In [23]:
# row wise selection of df

df[0:3]

                   A         B         C         D
2022-01-01  0.540202  0.782659  0.006355  0.917433
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395

In [24]:
df[1:3]

                   A         B         C         D
2022-01-02  0.415608  0.958381  0.049713  0.019675
2022-01-03  0.815870  0.556352  0.711700  0.068395

In [25]:
# another way to access specific data from df
df.loc[dates[5]]

A    0.999235
B    0.442767
C    0.916618
D    0.916194
Name: 2022-01-06 00:00:00, dtype: float64

In [26]:
# here no rows, only cols A and B 
df.loc[: , ["A","B"]]

                   A         B
2022-01-01  0.540202  0.782659
2022-01-02  0.415608  0.958381
2022-01-03  0.815870  0.556352
2022-01-04  0.850572  0.476434
2022-01-05  0.143740  0.084089
2022-01-06  0.999235  0.442767

In [27]:
# accessing a range(with colon sign) of dates from 2 to 4
df.loc["20200102":"20200104" , ["A","B"]]

Empty DataFrame
Columns: [A, B]
Index: []

In [ ]:
# now if we do list into list with same code
# accessing only 2 dates, with coma

df.loc[["20200102","20200104"] , ["A","B"]]

In [ ]:
# access data of 1 date and 3 columns 

df.loc["20200103" , ["A" ,"B" ,"C"]]

In [ ]:
# using "at" Function, to get specific cell value
df.at[dates[18], "A"]

0.5289002490376591

In [ ]:
# it will access all the cols but only one value from index or rows
df.iloc[3]

A    0.789405
B    0.758379
C    0.760497
D    0.872910
Name: 2020-01-04 00:00:00, dtype: float64

In [ ]:
# same previous function but with range
df.iloc[3:10]

In [ ]:
# 0 to 5 rows , and all cols
# same way we can change the cols too and rows too

df.iloc[0:5, : ]

#### -Boolean Conditions to get specific values

In [ ]:
# will only show values in col A those are > 0

df[df["A"]>0 ]

In [ ]:
df[df["A"]>0.5]

                   A         B         C         D
2020-01-02  0.911852  0.726556  0.471353  0.838468
2020-01-04  0.789405  0.758379  0.760497  0.872910
2020-01-07  0.730028  0.649075  0.770288  0.353364
2020-01-08  0.500332  0.334427  0.622795  0.016485
2020-01-09  0.912140  0.509348  0.806855  0.421813
2020-01-11  0.571909  0.151096  0.337682  0.073674
2020-01-12  0.814179  0.901009  0.668650  0.993288
2020-01-14  0.852984  0.343240  0.574285  0.851753
2020-01-16  0.984935  0.692132  0.261510  0.758994
2020-01-18  0.555103  0.270698  0.443376  0.603905
2020-01-19  0.879702  0.769095  0.140825  0.325748
2020-01-20  0.611469  0.891468  0.334305  0.944598

In [ ]:
# Boolean condition on more than 1 column

df[(df["C"]>0.5) & (df["D"]>0.5)]

                   A         B         C         D
2020-01-03  0.204449  0.499536  0.562165  0.966323
2020-01-04  0.789405  0.758379  0.760497  0.872910
2020-01-06  0.090185  0.257550  0.533385  0.594151
2020-01-12  0.814179  0.901009  0.668650  0.993288
2020-01-14  0.852984  0.343240  0.574285  0.851753

In [ ]:
df[df>0.5]

#### -Copying Data Frame

In [ ]:
# copying df into another variable df3

df3=df.copy()
df3

                   A         B         C         D
2022-01-01  0.769104  0.593393  0.103290  0.130795
2022-01-02  0.307538  0.998922  0.787966  0.273823
2022-01-03  0.279343  0.868693  0.674440  0.455452
2022-01-04  0.163994  0.961682  0.169608  0.854564
2022-01-05  0.927219  0.433049  0.749129  0.589571
2022-01-06  0.673585  0.422994  0.212162  0.602821

#### -Adding New column

In [ ]:
# now adding a new col into df3
#"one","two","three","four"
df3["newcolm"]=["1","2","3","4","1","2"]
df3

                   A         B         C         D newcolm
2022-01-01  0.769104  0.593393  0.103290  0.130795       1
2022-01-02  0.307538  0.998922  0.787966  0.273823       2
2022-01-03  0.279343  0.868693  0.674440  0.455452       3
2022-01-04  0.163994  0.961682  0.169608  0.854564       4
2022-01-05  0.927219  0.433049  0.749129  0.589571       1
2022-01-06  0.673585  0.422994  0.212162  0.602821       2

#### -Calculating mean/average

* A DataFrame object has two axes: axis 0 and axis 1. axis 0 represents rows and axis 1 represents columns.

In [ ]:
# left part of = will add a new col named "mean", and write part of = to calculate mean
df3["mean"]=df.mean(axis=1)
df3

                   A         B         C         D newcolm      mean
2022-01-01  0.769104  0.593393  0.103290  0.130795       1  0.399145
2022-01-02  0.307538  0.998922  0.787966  0.273823       2  0.592062
2022-01-03  0.279343  0.868693  0.674440  0.455452       3  0.569482
2022-01-04  0.163994  0.961682  0.169608  0.854564       4  0.537462
2022-01-05  0.927219  0.433049  0.749129  0.589571       1  0.674742
2022-01-06  0.673585  0.422994  0.212162  0.602821       2  0.477890